In [1]:
!pip install pandas

Collecting pandas
  Obtaining dependency information for pandas from https://files.pythonhosted.org/packages/9e/71/756a1be6bee0209d8c0d8c5e3b9fc72c00373f384a4017095ec404aec3ad/pandas-2.0.3-cp311-cp311-win_amd64.whl.metadata
  Downloading pandas-2.0.3-cp311-cp311-win_amd64.whl.metadata (18 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2023.3-py2.py3-none-any.whl (502 kB)
Collecting tzdata>=2022.1 (from pandas)
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     ------------------------------------- 341.8/341.8 kB 10.7 MB/s eta 0:00:00
Collecting numpy>=1.21.0 (from pandas)
  Obtaining dependency information for numpy>=1.21.0 from https://files.pythonhosted.org/packages/72/b2/02770e60c4e2f7e158d923ab0dea4e9f146a2dbf267fec6d8dc61d475689/numpy-1.25.2-cp311-cp311-win_amd64.whl.metadata
  Downloading numpy-1.25.2-cp311-cp311-win_amd64.whl.metadata (5.7 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.0.3-cp311-cp311-win_amd64.whl (10.6 MB)
   ---------------------------------------- 10.6/10.6 MB 24.2 MB/s eta 0:00:00
Downloading numpy-1.25.2-cp311-cp311-win_amd64.whl (15.5 MB)
   ---------------------------------------- 15.5/15.5 MB 23.3 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-1.25.2 pandas-2.0.3 pytz-2023.3 tzdata-2023.3

In [6]:
import pandas as pd

ser = pd.Series([1,2,3,4], index=["a","b","c","d"])
ser

a    1
b    2
c    3
d    4
dtype: int64

<시험 정보>
데이타 프레임에서
ioc같은거 쓸 줄 아냐?

시리즈와 데이터 프레임이 있다.
ser = pd.Series([1,2,3,4])
ser
-> 인덱싱을 따로 지정할 수 있다.
-> 같은 자료형을 사용해야 한다.

In [12]:
df = pd.DataFrame({
    "aa": [1,2,3],  # -> column이고 key이다.
    "bb" :["a","b","c"]
})
df  # -> jupyter에서만 가능한것이다. 변수만 써도 그 자체를 보여준다.
#print(df) -> 다른 데선 이렇게 써야함

   aa bb
0   1  a
1   2  b
2   3  c

In [13]:
df = pd.DataFrame({
    "aa": [1,2,3],  # -> column이고 key이다.
    "bb" :["a","b","c"]
})
df.aa

0    1
1    2
2    3
Name: aa, dtype: int64

In [14]:
df["aa"]

0    1
1    2
2    3
Name: aa, dtype: int64

In [16]:
df.columns

Index(['aa', 'bb'], dtype='object')

In [86]:
df = pd.read_csv("bike.csv")
df.head(10)
df.iloc[0, 0]

'2011-01-01 00:00:00'

In [44]:
df = pd.read_csv("bike.csv")
# df.loc[0,"datetime"]
# df.iloc[0:3,0:3]
# df.iloc[[0,100,10000],[0,3,4]]
# df.loc[[0,100,10000],["datetime","temp"]]
# df.loc[[0,100,10000],"datetime":"temp"]
# df.iloc[:3, 1:3].sum()
df.iloc[:,[1,9]].groupby("season").mean()

           casual
season
1       15.489576
2       47.446762
3       52.220271
4       28.580834

In [50]:
df.loc[:,["casual","registered"]].agg(["sum",'min',"max"])
# 행과, 열
# aggregation의 약자

     casual  registered
sum  392135     1693341
min       0           0
max     367         886

In [83]:
# df_sub = df[df.season == 1]  # 봄인것만 출력
# set(df_sub.season)  # 집합으로 바뀌는것 : 따라서 고유의 값 하나 나옴.

In [55]:
# df.season +1

0        2
1        2
2        2
3        2
4        2
        ..
10881    5
10882    5
10883    5
10884    5
10885    5
Name: season, Length: 10886, dtype: int64

In [81]:
# df.season ==1

In [79]:
# df_sub = df[(df.season ==1) & (df.holiday ==1)]
# df_sub

In [87]:
# casual 값이 10 이상인 데이터의 season 별 registered 합계를 구하세요
df[df.casual >= 10].loc[:, ["season","registered"]].groupby("season").sum()

        registered
season
1           170649
2           434124
3           476165
4           393582

In [89]:
df.fillna(df["count"].mean())

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0.0,0,1,9.84,14.395,81,0.0000,3,13,191.618855
1,2011-01-01 01:00:00,1,0.0,0,1,9.02,13.635,80,0.0000,8,32,191.618855
2,2011-01-01 02:00:00,1,0.0,0,1,9.02,13.635,80,0.0000,5,27,191.618855
3,2011-01-01 03:00:00,1,0.0,0,1,9.84,14.395,75,0.0000,3,10,13.000000
4,2011-01-01 04:00:00,1,0.0,0,1,9.84,14.395,75,0.0000,0,1,1.000000
...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,4,0.0,1,1,15.58,19.695,50,26.0027,7,329,336.000000
10882,2012-12-19 20:00:00,4,0.0,1,1,14.76,17.425,57,15.0013,10,231,241.000000
10883,2012-12-19 21:00:00,4,0.0,1,1,13.94,15.910,61,15.0013,4,164,168.000000
10884,2012-12-19 22:00:00,4,0.0,1,1,13.94,17.425,61,6.0032,12,117,129.000000
10885,2012-12-19 23:00:00,4,0.0,1,1,13.12,16.665,66,8.9981,4,84,88.000000

In [90]:
df.dropna() 
# column 번호가 바뀐다.

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
3,2011-01-01 03:00:00,1,0.0,0,1,9.84,14.395,75,0.0000,3,10,13.0
4,2011-01-01 04:00:00,1,0.0,0,1,9.84,14.395,75,0.0000,0,1,1.0
8,2011-01-01 08:00:00,1,0.0,0,1,9.84,14.395,75,0.0000,1,7,8.0
9,2011-01-01 09:00:00,1,0.0,0,1,13.12,17.425,76,0.0000,8,6,14.0
10,2011-01-01 10:00:00,1,0.0,0,1,15.58,19.695,76,16.9979,12,24,36.0
...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,4,0.0,1,1,15.58,19.695,50,26.0027,7,329,336.0
10882,2012-12-19 20:00:00,4,0.0,1,1,14.76,17.425,57,15.0013,10,231,241.0
10883,2012-12-19 21:00:00,4,0.0,1,1,13.94,15.910,61,15.0013,4,164,168.0
10884,2012-12-19 22:00:00,4,0.0,1,1,13.94,17.425,61,6.0032,12,117,129.0
10885,2012-12-19 23:00:00,4,0.0,1,1,13.12,16.665,66,8.9981,4,84,88.0

In [96]:
df_sub = df.loc[df["casual"] < df ["casual"].quantile(0.99),["casual"]]
df_sub

       casual
0           3
1           8
2           5
3           3
4           0
...       ...
10881       7
10882      10
10883       4
10884      12
10885       4

[10777 rows x 1 columns]

In [94]:
df["casual"].quantile(0.99)

240.14999999999964

In [129]:
# <우리가 만든 DB에서 직접 가져오기>
import pymysql
import pandas as pd

db = pymysql.connect(host="localhost", port=3306, user="root", password = "1234", db = "sba")
cursor = db.cursor()

# 가수명, 팔로워수, 노래, 제목, 앨범 명
sql = """SELECT singer.name, singer.follower, song.title, song.album
FROM song
    INNER JOIN singer
    ON song.singer_id=singer.id
"""
cursor.execute(sql)
rows = cursor.fetchall()
df = pd.DataFrame(rows)
df.columns = ["name", "follower","title", "album"]

db.close()
df

# #가수별로 TOP 100에 있는 제목의 수를 출력: count
df.loc[:, ["name","title"]].groupby("name").count()
df.loc[:, ["album","title"]].groupby("album").count().sort_values("title",ascending = False)
# # df_sub = df.loc[:, ["album", "title"]].groupby("album").count().sort_values("title",ascending = False)
# # df_sub.to_csv("result0804.csv")

                          title
album
ISTJ - The 3rd Album        150
IM HERO                     150
NewJeans 2nd EP Get Up       90
Ive IVE                      30
NewJeans OMG                 30
...                         ...
ANTIFRAGILE                  15
Still With You               15
Summer                       15
해요 (2022)                    15
잘 지내자, 우리 (여름날 우리 X 로이킴)      2

[70 rows x 1 columns]

In [115]:
import numpy as np

np.ones([5,4])

array([[1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.]])

In [123]:
# [1,2,3,4,5,..100]

a = []

for i in range(100):
    a.append(i)
    
# a = [i for i in range(100)]
# print(a)

a = [random.randint(1,100)for i in range(100)]
print(a)

NameError: name 'random' is not defined